###################################################################

# Created by write_sdc on Mon Jun  7 13:01:41 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {addr_data[63]}]
set_load -pin_load 3.40189 [get_ports {addr_data[62]}]
set_load -pin_load 3.40189 [get_ports {addr_data[61]}]
set_load -pin_load 3.40189 [get_ports {addr_data[60]}]
set_load -pin_load 3.40189 [get_ports {addr_data[59]}]
set_load -pin_load 3.40189 [get_ports {addr_data[58]}]
set_load -pin_load 3.40189 [get_ports {addr_data[57]}]
set_load -pin_load 3.40189 [get_ports {addr_data[56]}]
set_load -pin_load 3.40189 [get_ports {addr_data[55]}]
set_load -pin_load 3.40189 [get_ports {addr_data[54]}]
set_load -pin_load 3.40189 [get_ports {addr_data[53]}]
set_load -pin_load 3.40189 [get_ports {addr_data[52]}]
set_load -pin_load 3.40189 [get_ports {addr_data[51]}]
set_load -pin_load 3.40189 [get_ports {addr_data[50]}]
set_load -pin_load 3.40189 [get_ports {addr_data[49]}]
set_load -pin_load 3.40189 [get_ports {addr_data[48]}]
set_load -pin_load 3.40189 [get_ports {addr_data[47]}]
set_load -pin_load 3.40189 [get_ports {addr_data[46]}]
set_load -pin_load 3.40189 [get_ports {addr_data[45]}]
set_load -pin_load 3.40189 [get_ports {addr_data[44]}]
set_load -pin_load 3.40189 [get_ports {addr_data[43]}]
set_load -pin_load 3.40189 [get_ports {addr_data[42]}]
set_load -pin_load 3.40189 [get_ports {addr_data[41]}]
set_load -pin_load 3.40189 [get_ports {addr_data[40]}]
set_load -pin_load 3.40189 [get_ports {addr_data[39]}]
set_load -pin_load 3.40189 [get_ports {addr_data[38]}]
set_load -pin_load 3.40189 [get_ports {addr_data[37]}]
set_load -pin_load 3.40189 [get_ports {addr_data[36]}]
set_load -pin_load 3.40189 [get_ports {addr_data[35]}]
set_load -pin_load 3.40189 [get_ports {addr_data[34]}]
set_load -pin_load 3.40189 [get_ports {addr_data[33]}]
set_load -pin_load 3.40189 [get_ports {addr_data[32]}]
set_load -pin_load 3.40189 [get_ports {addr_data[31]}]
set_load -pin_load 3.40189 [get_ports {addr_data[30]}]
set_load -pin_load 3.40189 [get_ports {addr_data[29]}]
set_load -pin_load 3.40189 [get_ports {addr_data[28]}]
set_load -pin_load 3.40189 [get_ports {addr_data[27]}]
set_load -pin_load 3.40189 [get_ports {addr_data[26]}]
set_load -pin_load 3.40189 [get_ports {addr_data[25]}]
set_load -pin_load 3.40189 [get_ports {addr_data[24]}]
set_load -pin_load 3.40189 [get_ports {addr_data[23]}]
set_load -pin_load 3.40189 [get_ports {addr_data[22]}]
set_load -pin_load 3.40189 [get_ports {addr_data[21]}]
set_load -pin_load 3.40189 [get_ports {addr_data[20]}]
set_load -pin_load 3.40189 [get_ports {addr_data[19]}]
set_load -pin_load 3.40189 [get_ports {addr_data[18]}]
set_load -pin_load 3.40189 [get_ports {addr_data[17]}]
set_load -pin_load 3.40189 [get_ports {addr_data[16]}]
set_load -pin_load 3.40189 [get_ports {addr_data[15]}]
set_load -pin_load 3.40189 [get_ports {addr_data[14]}]
set_load -pin_load 3.40189 [get_ports {addr_data[13]}]
set_load -pin_load 3.40189 [get_ports {addr_data[12]}]
set_load -pin_load 3.40189 [get_ports {addr_data[11]}]
set_load -pin_load 3.40189 [get_ports {addr_data[10]}]
set_load -pin_load 3.40189 [get_ports {addr_data[9]}]
set_load -pin_load 3.40189 [get_ports {addr_data[8]}]
set_load -pin_load 3.40189 [get_ports {addr_data[7]}]
set_load -pin_load 3.40189 [get_ports {addr_data[6]}]
set_load -pin_load 3.40189 [get_ports {addr_data[5]}]
set_load -pin_load 3.40189 [get_ports {addr_data[4]}]
set_load -pin_load 3.40189 [get_ports {addr_data[3]}]
set_load -pin_load 3.40189 [get_ports {addr_data[2]}]
set_load -pin_load 3.40189 [get_ports {addr_data[1]}]
set_load -pin_load 3.40189 [get_ports {addr_data[0]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[63]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[62]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[61]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[60]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[59]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[58]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[57]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[56]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[55]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[54]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[53]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[52]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[51]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[50]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[49]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[48]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[47]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[46]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[45]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[44]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[43]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[42]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[41]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[40]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[39]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[38]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[37]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[36]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[35]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[34]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[33]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[32]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[31]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[30]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[29]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[28]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[27]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[26]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[25]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[24]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[23]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[22]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[21]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[20]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[19]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[18]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[17]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[16]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[15]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[14]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[13]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[12]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[11]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[10]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[9]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[8]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[7]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[6]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[5]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[4]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[3]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[2]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[1]}]
set_load -pin_load 3.40189 [get_ports {addr_instr[0]}]
set_load -pin_load 3.40189 [get_ports {wr_data[63]}]
set_load -pin_load 3.40189 [get_ports {wr_data[62]}]
set_load -pin_load 3.40189 [get_ports {wr_data[61]}]
set_load -pin_load 3.40189 [get_ports {wr_data[60]}]
set_load -pin_load 3.40189 [get_ports {wr_data[59]}]
set_load -pin_load 3.40189 [get_ports {wr_data[58]}]
set_load -pin_load 3.40189 [get_ports {wr_data[57]}]
set_load -pin_load 3.40189 [get_ports {wr_data[56]}]
set_load -pin_load 3.40189 [get_ports {wr_data[55]}]
set_load -pin_load 3.40189 [get_ports {wr_data[54]}]
set_load -pin_load 3.40189 [get_ports {wr_data[53]}]
set_load -pin_load 3.40189 [get_ports {wr_data[52]}]
set_load -pin_load 3.40189 [get_ports {wr_data[51]}]
set_load -pin_load 3.40189 [get_ports {wr_data[50]}]
set_load -pin_load 3.40189 [get_ports {wr_data[49]}]
set_load -pin_load 3.40189 [get_ports {wr_data[48]}]
set_load -pin_load 3.40189 [get_ports {wr_data[47]}]
set_load -pin_load 3.40189 [get_ports {wr_data[46]}]
set_load -pin_load 3.40189 [get_ports {wr_data[45]}]
set_load -pin_load 3.40189 [get_ports {wr_data[44]}]
set_load -pin_load 3.40189 [get_ports {wr_data[43]}]
set_load -pin_load 3.40189 [get_ports {wr_data[42]}]
set_load -pin_load 3.40189 [get_ports {wr_data[41]}]
set_load -pin_load 3.40189 [get_ports {wr_data[40]}]
set_load -pin_load 3.40189 [get_ports {wr_data[39]}]
set_load -pin_load 3.40189 [get_ports {wr_data[38]}]
set_load -pin_load 3.40189 [get_ports {wr_data[37]}]
set_load -pin_load 3.40189 [get_ports {wr_data[36]}]
set_load -pin_load 3.40189 [get_ports {wr_data[35]}]
set_load -pin_load 3.40189 [get_ports {wr_data[34]}]
set_load -pin_load 3.40189 [get_ports {wr_data[33]}]
set_load -pin_load 3.40189 [get_ports {wr_data[32]}]
set_load -pin_load 3.40189 [get_ports {wr_data[31]}]
set_load -pin_load 3.40189 [get_ports {wr_data[30]}]
set_load -pin_load 3.40189 [get_ports {wr_data[29]}]
set_load -pin_load 3.40189 [get_ports {wr_data[28]}]
set_load -pin_load 3.40189 [get_ports {wr_data[27]}]
set_load -pin_load 3.40189 [get_ports {wr_data[26]}]
set_load -pin_load 3.40189 [get_ports {wr_data[25]}]
set_load -pin_load 3.40189 [get_ports {wr_data[24]}]
set_load -pin_load 3.40189 [get_ports {wr_data[23]}]
set_load -pin_load 3.40189 [get_ports {wr_data[22]}]
set_load -pin_load 3.40189 [get_ports {wr_data[21]}]
set_load -pin_load 3.40189 [get_ports {wr_data[20]}]
set_load -pin_load 3.40189 [get_ports {wr_data[19]}]
set_load -pin_load 3.40189 [get_ports {wr_data[18]}]
set_load -pin_load 3.40189 [get_ports {wr_data[17]}]
set_load -pin_load 3.40189 [get_ports {wr_data[16]}]
set_load -pin_load 3.40189 [get_ports {wr_data[15]}]
set_load -pin_load 3.40189 [get_ports {wr_data[14]}]
set_load -pin_load 3.40189 [get_ports {wr_data[13]}]
set_load -pin_load 3.40189 [get_ports {wr_data[12]}]
set_load -pin_load 3.40189 [get_ports {wr_data[11]}]
set_load -pin_load 3.40189 [get_ports {wr_data[10]}]
set_load -pin_load 3.40189 [get_ports {wr_data[9]}]
set_load -pin_load 3.40189 [get_ports {wr_data[8]}]
set_load -pin_load 3.40189 [get_ports {wr_data[7]}]
set_load -pin_load 3.40189 [get_ports {wr_data[6]}]
set_load -pin_load 3.40189 [get_ports {wr_data[5]}]
set_load -pin_load 3.40189 [get_ports {wr_data[4]}]
set_load -pin_load 3.40189 [get_ports {wr_data[3]}]
set_load -pin_load 3.40189 [get_ports {wr_data[2]}]
set_load -pin_load 3.40189 [get_ports {wr_data[1]}]
set_load -pin_load 3.40189 [get_ports {wr_data[0]}]
set_load -pin_load 3.40189 [get_ports mem_rd]
set_load -pin_load 3.40189 [get_ports mem_wr]
create_clock [get_ports clk]  -name MY_CLK  -period 6.35  -waveform {0 3.175}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports IF_flush]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instr[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_instr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {wr_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports mem_rd]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports mem_wr]
