synopsys script

export SYNOPSYS_ROOT=/software/synopsys
export PATH=$PATH:$SYNOPSYS_ROOT/sold_current
export SYNOPSYS=$SYNOPSYS_ROOT/syn_current_64.18
export PATH=$SYNOPSYS/bin:$PATH

export LM_LICENSE_FILE=27020@led-x3850-3.polito.it

-----------------------------------------------------

define_design_lib WORK -path ./work
set search_path [list . /software/synopsys/syn_current_64_18/libraries/syn /software/dk/nangate45/synopsys ]
set link_library [list "*" "NangateOpenCellLibrary_typical_ecsm.db" "dw_foundation.sldb" ]
set target_library [list "NangateOpenCellLibrary_typical_ecsm.db" ]
set synthetic_library [list "dw_foundation.sldb" ]

dc_shell-xg-t

define_design_lib WORK -path ./work
analyze -f vhdl -lib WORK ../src/Adder.vhd
analyze -f vhdl -lib WORK ../src/reg.vhd
analyze -f vhdl -lib WORK ../src/Prog_counter.vhd
analyze -f vhdl -lib WORK ../src/mux2.vhd
analyze -f vhdl -lib WORK ../src/mux4.vhd
analyze -f vhdl -lib WORK ../src/Registers.vhd
analyze -f vhdl -lib WORK ../src/ALU.vhd
analyze -f vhdl -lib WORK ../src/ALU_ctrl.vhd
analyze -f vhdl -lib WORK ../src/ctrl.vhd
analyze -f vhdl -lib WORK ../src/forward_unit.vhd
analyze -f vhdl -lib WORK ../src/hazard_detection_unit.vhd
analyze -f vhdl -lib WORK ../src/ImmGen.vhd
analyze -f vhdl -lib WORK ../src/RAM.vhd
analyze -f vhdl -lib WORK ../src/RAM_2_16_64.vhd
analyze -f vhdl -lib WORK ../src/RISCV.vhd
set power_preserve_rtl_hier_names true
elaborate RISCV -arch Structure -lib WORK
create_clock -name MY_CLK -period 5.95 clk
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

compile

report_timing > rep_timing.txt

report_area > rep_area.txt

report_power > rep_pow.txt

ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../netlist/RISCV.sdf
write -f verilog -hierarchy -output ../netlist/RISCV.v
write_sdc ../netlist/RISCV.sdc


